Darklight007/ESP32PS3/src/DispObject.h
#ifndef DISPOBJECT_H
#define DISPOBJECT_H

// Shared with device.cpp's `formats[]` table (adcNumberOfDigits setting) so
// displayUpdate() can pointer-compare `restrict` against it instead of
// strcmp-ing the format string every tick.
extern const char *const kFmt4Decimals;

// Horizontal nudge (px) applied to the orange digit-highlight box's x-offset
// in both its default position (DispObject.cpp setup()) and every step-size
// realignment (input_handler.cpp's W/X/Y hold handlers) - one knob to shift
// it left/right without touching the per-digit "N * 12" column math.
constexpr int kHighlightXShift = 5;
// W-hold (coarsest/whole-unit digit) needs 2px left of its original position
// (7*12) net, i.e. 1px more than kHighlightXShift alone gives it - applied
// on top of kHighlightXShift, only for the W-hold case.
constexpr int kHighlightXShiftWExtra = -3;

#include <algorithm>
#include <vector>
#include <lvgl.h>
#include "myFonts.h"
#include "ESP32Encoder.h"
#include "buzzer.h"

#include <cmath>
#include <cstdint>
#include <algorithm>
#include <limits>

const int MAX_NO_OF_AVG = 128;
// extern  uint64_t MAX_NO_OF_AVG;

// #include "config.hpp"
// #include "gLobalVariables.h"

LV_IMG_DECLARE(p_l);
LV_IMG_DECLARE(p_u);

// extern TFT_eSPI tft;
// extern lv_style_t style_unit;
// extern lv_style_t style_set;

class Histogram
{
public:
    const int length_ = 350;
    lv_coord_t data[350] = {0};
    // double m = 50;
    // double b = 0;
    lv_obj_t *label_binMax;
    lv_obj_t *label_binMin;
    lv_obj_t *label_numberOfBin;
    lv_obj_t *label_binWidth;

    uint16_t binMax = -INFINITY;
    uint16_t binMin = INFINITY;
    uint16_t numberOfBin;
    // double binWidth;
    int maxHist;
    float histWinMin;
    float histWinMax;
    uint16_t cap = 164;

    Histogram() {};
    ~Histogram() {}

    void updateMinMax(int index)
    {
        if (index < binMin)
            binMin = index;
        if (index > binMax)
            binMax = index;
    }

    void rescaleHistogram()
    {
        maxHist = *std::max_element(data, data + length_);
        binMin = length_; // Reset binMin to maximum possible value
        binMax = -1;      // Reset binMax to minimum possible value

        for (int i = 0; i < length_; ++i)
        {
            // data[i] = static_cast<int>(data[i] * cap / maxHist);
            // data[i] = data[i] * cap / maxHist;
            // data[i] -= 10;
            //  if (data[i] < 0) data[i]=0;
            data[i] = std::max(0, data[i] - 3); // Decrement by 3 and clamp to 0 in one step

            if (data[i] != 0)
            {
                if (i < binMin)
                    binMin = i;
                if (i > binMax)
                    binMax = i;
            }
        }
    }

    void operator[](const double &value)
    {
        int Length_ = 328;
        const int index = 10 + static_cast<int>(std::round((value - histWinMin) / (histWinMax - histWinMin) * Length_));

        if (index < 0 || index >= length_)
            return;

        data[index]++;
        updateMinMax(index);

        if (data[index] > (cap + 3))
        {
            rescaleHistogram();
        }
    }
    void Reset()
    {
        for (int iter = 0; iter < length_; ++iter)
        {
            // data[iter] *= cap / maxHist;
            if (data[iter] == 0)
                continue;
            // auto &val = *iter;

            if (iter < binMin)
                binMin = iter;

            if (iter > binMax)
                binMax = iter;
        }

        for (auto &val : data)
            val = 0;
    }
    int RangeMin()
    {
        int iter = 0;
        for (iter = 0; iter < length_; ++iter)
        {
            // data[iter] *= cap / maxHist;
            if (data[iter] != 0)
                break;
            else
                continue;
        }

        return iter;
    }

    int RangeMax()
    {
        int iter = 0;
        for (iter = length_; iter >= 0; --iter)
        {
            // data[iter] *= cap / maxHist;
            if (data[iter] != 0)
                break;
            else
                continue;
        }

        return iter;
    }
};

//***********************************************************
// https://stackoverflow.com/questions/10990618/calculate-rolling-moving-average-in-c
// class MovingStats
// {
// public:
//     double value;
//     double mean;
//     double absMin = +INFINITY, absMax = -INFINITY;
//     bool enable = false;
//     uint16_t NofAvgs = MAX_NO_OF_AVG;
//     uint64_t windowSizeIndex_{0};

// public:
//     double samples_[MAX_NO_OF_AVG]; // Maximum number of average
//     double sum_{0};

//     MovingStats(int n)
//     {
//         SetWindowSize(n);
//     }
//     MovingStats()
//     {
//         SetWindowSize(64);
//     }

//     MovingStats &operator()(double sample)
//     {

//         value = sample;
//         // if (windowSizeIndex_ == 0)
//         //     sum_ = 0;

//         if (absMin > sample)
//         {
//             absMin = sample;
//             //  myTone(NOTE_A3, 1);
//         }

//         if (absMax < sample)
//         {
//             absMax = sample;
//             //  myTone(NOTE_A4, 1);
//         }

//         sum_ += sample;

//         if (windowSizeIndex_ < NofAvgs)

//             samples_[windowSizeIndex_++] = sample;

//         else
//         {
//             double &oldest = samples_[windowSizeIndex_++ % NofAvgs];
//             sum_ -= oldest;
//             oldest = sample;
//         }

//         // history.push_back(sample);
//         // if (history.size() > 100)
//         // history.erase(std::begin(history));

//         return *this;
//     }

//     ~MovingStats() {}

//     void SetWindowSize(uint16_t w)
//     {
//         NofAvgs = w;
//         sum_ = 0; // value;
//         windowSizeIndex_ = 0;
//         // samples_[windowSizeIndex_++] = 0;
//     }
//     operator double() const { return sum_ / std::max((const long long unsigned)1, std::min(windowSizeIndex_, uint64_t(NofAvgs))); }

//     double Mean() const
//     {
//         return sum_ / std::max((const long long unsigned)1, std::min(windowSizeIndex_, uint64_t(NofAvgs)));
//     }

//     double Sum() const { return sum_; }

//     double Rms() const
//     {
//         double total = 0;
//         size_t currentSize = std::min(windowSizeIndex_, uint64_t(NofAvgs));
//         for (int i = 0; i < currentSize; i++)
//             total += samples_[i] * samples_[i];

//         return sqrt(total / double(NofAvgs));
//     }

//     double Variance() const
//     {
//         double mu = Mean();
//         double total = 0;

//         size_t currentSize = std::min(windowSizeIndex_, uint64_t(NofAvgs));
//         for (int i = 0; i < currentSize; i++)
//             total += (samples_[i] - mu) * (samples_[i] - mu);

//         return (currentSize > 1) ? total / (currentSize - 1) : 0.0;
//     }

//     double StandardDeviation() const
//     {
//         return sqrt(Variance());
//     }

//     // Effective resolution:
//     // https://www.eetimes.com/understanding-noise-enob-and-effective-resolution-in-analog-to-digital-converters/
//     // https://training.ti.com/adc-noise-measurement-methods-parameters @12:30
//     double ER(double FSR)
//     {

//         return double(log2(FSR / (StandardDeviation())));
//     }

//     void ResetStats()
//     {
//         SetWindowSize(NofAvgs);
//         absMin = INFINITY;
//         absMax = -INFINITY;
//         sum_ = 0; // value;
//         windowSizeIndex_ = 0;
//     }
// };

class MovingStatistics
{
public:
    // Public member variables
    std::vector<double> samples_;
    double value;
    double absMin = +std::numeric_limits<double>::infinity();
    double absMax = -std::numeric_limits<double>::infinity();
    bool enable = false;
    uint16_t NofAvgs;
    uint64_t windowSizeIndex_{0};
    double sum_{0.0};
    double sum_sq_{0.0}; // Running sum of squares for RMS
    mutable double cachedMean_{0.0}; // OPTIMIZATION: Cached mean to avoid repeated divisions
    mutable bool meanDirty_{true};   // Flag to track if mean needs recalculation

    // EXPERIMENTAL (see experimental-er-fix branch): Welford running mean/M2,
    // tracked in parallel with sum_/sum_sq_ purely to compute a numerically
    // stable Variance()/StandardDeviation(). The old "sum_sq_ - sum_*mean"
    // formula suffers catastrophic cancellation when the signal's mean is
    // large relative to its noise (e.g. Voltage's ~32V range vs mV-scale
    // ripple), causing Effective Resolution to drift until ResetStats() is
    // called. Welford's incremental deviation-from-mean formula doesn't
    // difference two large near-equal numbers, so it doesn't drift the same
    // way. sum_/sum_sq_ are kept untouched for Mean()/Rms()/Sum().
    double welfordMean_{0.0};
    double M2_{0.0};

