Darklight007/ESP32PS3/src/DispObject.h
    // Constructor with explicit keyword to prevent implicit conversions
    explicit MovingStatistics(uint16_t n = 64)
        : NofAvgs(n), samples_(n, 0.0)
    {
        if (NofAvgs == 0)
        {
            throw std::invalid_argument("Window size must be greater than 0.");
        }
        ResetStats();
    }

    // Overloaded function call operator to add a new sample
    MovingStatistics &operator()(double sample)
    {
        value = sample;

        // Update minimum and maximum
        absMin = std::min(absMin, sample);
        absMax = std::max(absMax, sample);

        sum_ += sample;
        if (windowSizeIndex_ < NofAvgs)
        {
            // Initial filling of the window
            size_t index = windowSizeIndex_++;
            samples_[index] = sample;
            sum_sq_ += sample * sample;

            // Welford add-only (window not yet full): count goes from index to index+1
            double delta = sample - welfordMean_;
            welfordMean_ += delta / static_cast<double>(index + 1);
            double delta2 = sample - welfordMean_;
            M2_ += delta * delta2;
        }
        else
        {
            // Window is full; remove the oldest sample and add the new one
            size_t index = windowSizeIndex_ % NofAvgs;
            double oldest = samples_[index];
            samples_[index] = sample;
            sum_ += -oldest;
            sum_sq_ += sample * sample - oldest * oldest;
            windowSizeIndex_++;

            if (NofAvgs > 1)
            {
                // Welford removal of `oldest` (count NofAvgs -> NofAvgs-1)
                double deltaR = oldest - welfordMean_;
                double meanAfterRemove = welfordMean_ - deltaR / static_cast<double>(NofAvgs - 1);
                M2_ -= deltaR * (oldest - meanAfterRemove);
                welfordMean_ = meanAfterRemove;

                // Welford add of `sample` (count NofAvgs-1 -> NofAvgs)
                double deltaA = sample - welfordMean_;
                welfordMean_ += deltaA / static_cast<double>(NofAvgs);
                double delta2A = sample - welfordMean_;
                M2_ += deltaA * delta2A;

                // Welford's removal step is NOT numerically stable: subtracting a
                // sample's contribution back out loses precision every time, and on
                // a quiet signal (deltas near zero, which is exactly our case at
                // steady state) M2_ collapses to 0 or drifts negative within a few
                // windows. Variance() then clamps to 0, StandardDeviation() returns
                // 0, and ER() hands back its 0.0 sentinel - so a CLEANER signal
                // produced a LOWER reported ER. Confirmed live: a 32-sample window
                // with the mean visibly moving still reported stddev == 0.
                // Re-derive mean/M2/sum exactly once per full window: O(N) every N
                // samples = O(1) amortized, and it bounds the drift permanently.
                if (windowSizeIndex_ % NofAvgs == 0)
                {
                    double m = 0.0;
                    for (uint16_t i = 0; i < NofAvgs; i++) m += samples_[i];
                    m /= static_cast<double>(NofAvgs);

                    double m2 = 0.0, s2 = 0.0;
                    for (uint16_t i = 0; i < NofAvgs; i++)
                    {
                        double d = samples_[i] - m;
                        m2 += d * d;
                        s2 += samples_[i] * samples_[i];
                    }
                    welfordMean_ = m;
                    M2_ = m2;
                    sum_ = m * static_cast<double>(NofAvgs);
                    sum_sq_ = s2;
                }
            }
        }

        // OPTIMIZATION: Mark mean as dirty so it will be recalculated on next access
        meanDirty_ = true;

        return *this;
    }

    // Set a new window size
    void SetWindowSize(uint16_t w)
    {
        if (w == 0)
        {
            throw std::invalid_argument("Window size must be greater than 0.");
        }
        NofAvgs = w;
        samples_.resize(NofAvgs, 0.0); // Resize and initialize the vector
        std::fill(samples_.begin(), samples_.end(), 0.0);
        ResetStats();
    }

    // Calculate the mean of the samples
    // OPTIMIZED: Uses cached value to avoid repeated divisions (10-40 CPU cycles saved per call)
    double Mean() const
    {
        if (meanDirty_) {
            cachedMean_ = sum_ / std::max(uint64_t(1), std::min(windowSizeIndex_, uint64_t(NofAvgs)));
            meanDirty_ = false;
        }
        return cachedMean_;
    }

    // Get the sum of the samples
    double Sum() const
    {
        return sum_;
    }

    // Calculate the Root Mean Square (RMS) of the samples
    double Rms() const
    {
        uint64_t currentSize = std::min(windowSizeIndex_, static_cast<uint64_t>(NofAvgs));
        if (currentSize == 0)
            return 0.0;
        return std::sqrt(sum_sq_ / static_cast<double>(currentSize));
    }

    // Calculate the variance of the samples.
    // EXPERIMENTAL: uses the Welford running M2 (see operator() above) instead
    // of sum_sq_ - sum_*mean, which loses precision when the mean is large
    // relative to the noise (Voltage's ER drift). Same result, stable long-term.
    double Variance() const
    {
        size_t n = std::min(windowSizeIndex_, static_cast<uint64_t>(NofAvgs));
        if (n < 2)
            return 0.0;
        double variance = M2_ / static_cast<double>(n - 1);
        return (variance >= 0.0) ? variance : 0.0;
    }

    // Calculate the standard deviation of the samples
    double StandardDeviation() const
    {
        double var = Variance();
        return (var > 0.0) ? std::sqrt(var) : 0.0;
    }

    // Calculate ER (Effective Resolution) given Full Scale Range (FSR)
    double ER(double FSR) const
    {
        double stdDev = StandardDeviation();
        return (stdDev > 0.0) ? std::log2(FSR / stdDev) : 0.0;
    }

    // Reset all statistics and clear the window
    void ResetStats()
    {
        std::fill(samples_.begin(), samples_.end(), 0.0);
        sum_ = 0.0;
        sum_sq_ = 0.0;
        windowSizeIndex_ = 0;
        absMin = +std::numeric_limits<double>::infinity();
        absMax = -std::numeric_limits<double>::infinity();
        cachedMean_ = 0.0;
        meanDirty_ = true;  // OPTIMIZATION: Mark mean for recalculation
        welfordMean_ = 0.0;
        M2_ = 0.0;
    }
};

class Moving_Stats
{
public:
    std::vector<double> samples_;
    double value;
    double mean;
    double absMin = +INFINITY, absMax = -INFINITY;
    bool enable = false;
    uint16_t NofAvgs;
    uint64_t windowSizeIndex_{0};
    double sum_{0};

    double M2 = 0.0; // Sum of squares of differences from the current mean

