Darklight007/ESP32PS3/src/DispObject.h
    explicit Moving_Stats(uint16_t n = 64) : NofAvgs(n), samples_(n)
    {
        ResetStats();
    }

    Moving_Stats &operator()(double sample)
    {
        value = sample;

        // Update min and max statistics
        absMin = std::min(absMin, sample);
        absMax = std::max(absMax, sample);

        // Update the mean and variance using Welford's online algorithm adapted for a moving window
        // Update running total sum
        sum_ += sample;
        if (windowSizeIndex_ < NofAvgs)
        {
            // Still filling the initial window
            int index = windowSizeIndex_++;
            double delta = sample - mean;
            mean += delta / windowSizeIndex_;
            M2 += delta * (sample - mean);
            samples_[index] = sample;
        }
        else
        {
            // Window is full, roll over the oldest data point
            int index = windowSizeIndex_ % NofAvgs;
            double oldest = samples_[index];
            double delta = sample - oldest;
            double delta2 = sample - mean;
            sum_ -= oldest;
            mean += delta / NofAvgs;
            M2 += delta2 * (sample - mean) + delta * (oldest - mean);
            samples_[index] = sample;
            windowSizeIndex_++;
            // sum_ += sample;
        }

        // if (windowSizeIndex_ < NofAvgs)
        // {
        //     samples_[windowSizeIndex_++] = sample;
        // }
        // else
        // {
        //     double &oldest = samples_[windowSizeIndex_++ % NofAvgs];
        //     sum_ -= oldest;
        //     oldest = sample;
        // }

        return *this;
    }

    void SetWindowSize(uint16_t w)
    {
        NofAvgs = w;
        samples_.resize(NofAvgs, 0.0); // Resize and initialize the vector
        std::fill(samples_.begin(), samples_.end(), 0.0);
        sum_ = 0;
        windowSizeIndex_ = 0;
        absMin = +INFINITY;
        absMax = -INFINITY;
    }

    double Mean() const
    {
        //   return mean;
        // return value;
        return sum_ / std::max(uint64_t(1), std::min(windowSizeIndex_, uint64_t(NofAvgs)));
    }

    double Sum() const
    {
        return sum_;
    }

    double Rms() const
    {
        double total = 0;
        size_t currentSize = std::min(windowSizeIndex_, uint64_t(NofAvgs));
        for (size_t i = 0; i < currentSize; ++i)
        {
            total += samples_[i] * samples_[i];
        }
        return sqrt(total / currentSize);
    }

    double Variance() const
    {
        // double mu = Mean();
        // double total = 0;
        // size_t currentSize = std::min(windowSizeIndex_, uint64_t(NofAvgs));
        // for (size_t i = 0; i < currentSize; ++i)
        // {
        //     double diff = samples_[i] - mu;
        //     total += diff * diff;
        // }
        // return currentSize > 1 ? total / (currentSize - 1) : 0.0;
        return (windowSizeIndex_ >= NofAvgs) ? M2 / NofAvgs : (windowSizeIndex_ > 1 ? M2 / (windowSizeIndex_ - 1) : 0);
    }

    double StandardDeviation() const
    {
        return sqrt(Variance());
    }

    double ER(double FSR) const
    {
        return log2(FSR / StandardDeviation());
    }

    void ResetStats()
    {

        std::fill(samples_.begin(), samples_.end(), 0.0);
        // samples_.resize(NofAvgs, 0.0);  // Resize and initialize the vector
        sum_ = 0;
        windowSizeIndex_ = 0;
        absMin = +INFINITY;
        absMax = -INFINITY;
        mean = 0.0;
        M2 = 0.0;
    }
};

// Main Class ***********************************************************

struct _bar
{
    lv_obj_t *bar;
    lv_obj_t *bar_minMarker;
    lv_obj_t *bar_maxMarker;
    lv_obj_t *bar_maxValue;

    lv_obj_t *bar_adjValue;
    lv_obj_t *label_measureValue;
    bool changed = true;
    double oldValue;
    double scaleFactor;
    int32_t *curValuePtr;      // Direct pointer to lv_bar_t.cur_value
    lv_coord_t *minMarkerXPtr; // Direct pointer to marker X coordinate
    lv_coord_t *maxMarkerXPtr; // Direct pointer to marker X coordinate
};

struct _statisticsSmallLabels
{
    lv_obj_t *label_unit;
    lv_obj_t *label_setSmallFont;
    lv_obj_t *label_value;
    lv_obj_t *label_mean;
    lv_obj_t *label_std;
    lv_obj_t *label_max;
    lv_obj_t *label_min;
    lv_obj_t *label_fft;
    lv_obj_t *label_legend;
};
class DispObjects
{

private:
public:
    lv_obj_t *label_set;
    lv_obj_t *label_si_prefix;
    lv_obj_t *label_setValue;
    lv_obj_t *label_measureValue;
    lv_obj_t *label_unit;
    lv_obj_t *highlight_adjValue;
    _bar Bar;
    _statisticsSmallLabels statLabels;

    lv_obj_t *lock_img;
    lv_obj_t *unlock_img;

    MovingStatistics measured;
    MovingStatistics Statistics;
    MovingStatistics effectiveResolution;
    
    // Voltage has one range, so a single instance is correct there. Current has
    // two ranges (A / mA) with different ADC gain, so raw codes from one range
    // are not the same population as the other - PowerSupply.Current uses
    // rawValueStats for the A range and rawValueStats_mA for mA, selected by
    // mA_Active, so switching ranges doesn't mix codes from both into one
    // rolling average. rawValueStats_mA sits unused on Voltage.
    MovingStatistics rawValueStats;
    MovingStatistics rawValueStats_mA;
    //  MovingStats measuredRaw;

    Histogram hist;

    int rawValue;
    double rawBarValue;  // Raw value for bar display (independent of averaging)
    double calib_m;
    double calib_1m;
    double calib_b;
    double internalResistance = (80e3 * 80e3) / (80e3 + 80e3); // 40kOhm

    double maxValue;
    double dac_maxValue;
    double adc_maxValue;
    double minValue;
    uint16_t adjValue;
    uint16_t adjOffset;
    double adjFactor;
    uint16_t adjValueOld;
    volatile bool adjValueChanged = true;  // set on Core 0 (SetUpdate), read/cleared on Core 1 (Flush)
    uint16_t adjEEPROMAddress = 0;

    double oldValue;
    unsigned long timeKeeper{0};
    bool changed;
    uint32_t sampleCountSinceDisplay{0};  // Counter for proportional display update
    bool displayReady{false};              // Flag when enough samples collected

    const char *restrict {"%+07.3f"};
    bool isPowerObj{false}; // cached once in setup() - avoids a strcmp/lv_label_get_text per displayUpdate() tick
    const lv_font_t *font_measure{&lv_font_montserrat_42}; // dseg_b_48
    const lv_font_t *font_set{&graph_R_16};                //&unscii_16b4 Tauri_R_20
    const lv_font_t *font_unit{&Tauri_R_62};

