Darklight007/ESP32PS3/src/DispObject.h
    lv_color_t measureColor;
    lv_color_t statColor;

    lv_style_t style_measure;
    lv_style_t style_unit;
    lv_style_t style_si_prefix;
    lv_style_t style_deviceColor;
    lv_style_t stat_style1;
    lv_style_t stat_style2;
    lv_style_t style_highlight_adjValue;
    lv_style_t style_set;

    // int tick = 1;
    long rotaryEncoderStep{1};

    // Per-instance bar cache (avoids stale shared statics across V/I/P)
    lv_coord_t cachedBarMax{0};
    int lastMaxMarkerX{INT32_MIN}; // per-instance: barUpdate() marker change-detect
    int lastMinMarkerX{INT32_MIN};
    lv_coord_t cachedBarWidth{0};
    lv_coord_t cachedBarX{0};
    double cachedScaleFactor{0};

    bool lock = true;
    ESP32Encoder encoder;

    String adcRate = "20 SPS";
    void SetEncoderPins(int aPintNumber, int bPinNumber, enc_isr_cb_t enc_isr_cb);

    DispObjects();
    ~DispObjects();

    void measureUpdate(double value);
    void StatisticsUpdate(double value);
    void displayUpdate(void);
    void displayUpdate(bool update);
    void statUpdate(void);
    void barUpdate(void);

    void enableSetting(bool onOff);
    char *getValue();
    void SetRotaryStep(double val);
    // bypassLock: for internal/programmatic control (e.g. the battery
    // charger's own CC/CV setpoint stepping) that must keep working while
    // the lock icon is engaged to block *user* input. Defaults to false so
    // every existing call site (encoder, keypad, direct entry) is unaffected.
    void SetUpdate(int value, bool bypassLock = false);
    void Flush(void);
    // Setpoint shadow-bar width in px - single source of truth shared by
    // SetUpdate() (Core 1 direct write) and Flush() (deferred Core 0 changes),
    // range-aware for Current's mA mode. See definition for the unit math.
    lv_coord_t shadowBarWidth(void);
    void SetEncoderUpdate(void);
    void setLock(bool lck);
    bool getLock();
    void setMeasureColor(lv_color_t color);
    void setStatsColor(lv_color_t color);
    void setup(lv_obj_t *parent, const char *_text, int x, int y, const char *_unit, double maxValue_, double minValue_, double mTick,
               double offset, double factor, const char *si_prefix, const lv_font_t *font_measure = &dseg_b_48, const lv_font_t *font_unit = &Tauri_R_62);
    // const lv_font_t *font_measure, const lv_font_t *font_unit);
    void SetupStyles();
};

#endif